Revit 2026 API

# DocumentCreatingEventArgs Properties

---

The DocumentCreatingEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs) |
|  | DocumentType | Type of the document which is about to be created, e.g. Project or Template. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs) |
|  | Template | The template file path to be used for creating the new document. |

#### Reference

DocumentCreatingEventArgs Class

Autodesk.Revit.DB.Events Namespace